03-For-an-editor/init-daily-using.org
#+TITLE: 用Emacs写文档
#+LANGUAGE:  zh
#+AUTHOR: Lu Jianmei
#+EMAIL: lu.jianmei@trs.com.cn
#+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t p:t pri:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t email:t
#+DESCRIPTION: A notes that include all works and study things in 2015
#+KEYWORDS:  org-mode Emacs jquery jquery.mobile jquery.ui wcm
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \setCJKmainfont{SimSun}
#+LATEX_CLASS: cn-article
#+STARTUP: logredeadline, logreschedule
#+ATTR_HTML: :border 2 :rules all :frame all

* Gernal packages configurations
当前分类下，列出支持的包的配置信息。
** Auto complete using company-mode
自动完成功能的配置，可以基于它针对不同的语言进行配置自动提示功能；
#+begin_src emacs-lisp :tangle yes
    ;; Turn on auto complete.
  ;;  (require 'auto-complete-config)       
    ;;(ac-config-default)

  (use-package company
    :defer t
    :config (add-hook 'prog-mode-hook 'company-mode))

#+end_src

** Manage the dash package
此包用于在macbook上调用dash应用的功能，其它操作系统可以不用；
#+begin_src emacs-lisp :tangle yes
  (use-package dash
    :defer t)
#+end_src

** Config the backups
配置自动备份；
#+BEGIN_SRC emacs-lisp :tangle yes
;;(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq backup-directory-alist '(("." . (expand-file-name "backups" user-emacs-directory))))
#+END_SRC

** Save files
Emacs中的自动保存功能，单独存储在另一个文件夹中。
#+BEGIN_SRC emacs-lisp :tangle yes
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
;;(setq auto-save-file-name-transforms '((".*" (expand-file-name "auto-save-list" user-emacs-directory) t)))
#+END_SRC

** Save history
保存历史记录
From http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp :tangle yes
;;(setq savehist-file "~/.emacs.d/savehist")
(setq savehist-file (expand-file-name "savehist" user-emacs-directory))
(savehist-mode 1)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
#+END_SRC


** Macros

*** Key bindings configuration for Macros
#+begin_src emacs-lisp :tangle yes

#+end_src
*** Key bindings for Macros
#+CAPTION: Org-mode快捷键
     #+ATTR_LATEX: :environment longtable :align l|l|l
|--------------------+-------------------------+-----------------------------------------------------------------------------------------------|
| 宏                 | C-x (                   | 开始录制宏                                                                                    |
|                    | C-x )                   | 结束录制宏                                                                                    |
|                    | C-x e                   | 使用宏                                                                                        |
|                    | C-u                     | 重复使用宏，C-u 100 C-x e重复100次                                                            |
|                    | M-x name-last-kbd-macro | 保存宏，可以在其它地方通过M-x调用此保存好的宏                                                 |
|--------------------+-------------------------+-----------------------------------------------------------------------------------------------|
|                    |                         |                                                                                               |

** Markdown mode

*** Configuration
For markdown mode base configuration, please find [[file:../03-For-an-editor/init-markdown-mode.el][Init-markdown-mode]].
#+begin_src emacs-lisp :tangle yes

;; load my own markdown mode configuration from init-markdown-mode.el
;;(require 'init-markdown-mode)
  (starter-kit-load "03-For-an-editor/init-markdown-mode.org")


#+end_src
** Tramp
*** Configuration
#+begin_src emacs-lisp :tangle yes
;; setting for tramp
(setq tramp-default-method "ssh")

;; config for caching password for 36000s
(setq password-cache-expiry 36000)

#+end_src
** DONE Winner mode - undo and redo window configuration
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]

=winner-mode= lets you use =C-c <left>= and =C-c <right>= to switch between window configurations. This is handy when something has popped up a buffer that you want to look at briefly before returning to whatever you were working on. When you're done, press =C-c <left>=.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package winner
  :defer t)
#+END_SRC

** DONE Mode line format
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
Display a more compact mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smart-mode-line
    :defer t)
#+END_SRC

** DONE Undo tree
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
Allow us to visually walk through the changes you've made, undo back to a certain point (or redo), and go down different branches.
Shot key binding: =(C-x u)=
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package undo-tree
    :defer t
    :diminish undo-tree-mode
    :config
    (progn
      (global-undo-tree-mode)
      (setq undo-tree-visualizer-timestamps t)
      (setq undo-tree-visualizer-diff t)))

#+END_SRC

** DONE Help - guide key
    - State "DONE"       from ""           [2016-05-29 Sun 07:02]
This library is very helpful, we can use it to help us remember or find the shot key binding. It will pops up a mini-buffer to show us the shot-key when we typed first part with a shot delay.
=(guide-key)= 包可以帮助我们查看操作的快捷键，对于一些不太常用的快捷键想不起来的时候，可以输入快捷键的前缀后，暂停一下，Emacs即会弹出一个子窗口，列出当前前缀下可以选择的快捷键，及其函数名称。以方便我们进行查找。
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package guide-key
  :defer t
  :diminish guide-key-mode
  :config
  (progn
  (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
  (guide-key-mode 1)))  ; Enable guide-key-mode
#+END_SRC
