03-For-an-editor/init-daily-using.org
** DONE Encoding configruation
    - State "DONE"       from ""           [2016-05-29 Sun 07:03]
This configuration from: http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp :tangle yes
(prefer-coding-system 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

** DONE Helm
   - State "DONE"       from ""           [2016-05-29 Sun 07:03]

*** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package helm
    :defer t
    :diminish helm-mode
    :init
    (progn
      (require 'helm-config)
      (setq helm-candidate-number-limit 100)
      ;; From https://gist.github.com/antifuchs/9238468
      (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
            helm-input-idle-delay 0.01  ; this actually updates things
                                          ; reeeelatively quickly.
            helm-yas-display-key-on-candidate t
            helm-quick-update t
            helm-buffers-fuzzy-matching t
            helm-recentf-fuzzy-match t
            helm-buffers-fuzzy-matching t
            helm-M-x-fuzzy-match t
            helm-mode-fuzzy-match t
            helm-completion-in-region-fuzzy-match t
            helm-recentf-fuzzy-match t
            helm-semantic-fuzzy-match t
            helm-imenu-fuzzy-match t
            helm-apropos-fuzzy-match t
            helm-lisp-fuzzy-completion t
            helm-M-x-requires-pattern nil
            helm-autoresize-mode 1 ;; resize the window
            helm-autoresize-max-height 40 ;; make the max height as 40% percent of current frame height
            helm-ff-skip-boring-files t)
      (helm-mode))
    :bind (("C-c h" . helm-mini)
           ("C-x c a" . helm-apropos)
           ("C-x C-b" . helm-buffers-list)
           ("C-x b" . helm-buffers-list)
           ("M-y" . helm-show-kill-ring)         ("M-x" . helm-M-x)
           ("C-x c o" . helm-occur)
           ("C-x c s" . helm-swoop)
           ("C-x c y" . helm-yas-complete)
           ("C-x c Y" . helm-yas-create-snippet-on-region)
           ("C-x c b" .  helm-do-grep-book-notes)
           ("C-x c i" . helm-org-in-buffer-headings)
           ("C-x c SPC" . helm-all-mark-rings)))
  ;(ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally


  (use-package helm-descbinds
    :defer t
    :bind (("C-x c b" . helm-descbinds)
           ("C-x c w" . helm-descbinds)))

  ;; Use helm to browse my notes files
  (defvar book-notes-directory "~/workspace/github/work-notes")
  (defun helm-do-grep-book-notes ()
    "Search my book notes."
    (interactive)
    (helm-do-grep-1 (list book-notes-directory)))
#+end_src
** DONE Helm-swoop
    - State "DONE"       from ""           [2016-05-29 Sun 07:03]
#+begin_src emacs-lisp :tangle yes

  ;; setting for helm-swoop

  ;; https://github.com/ShingoFukuyama/helm-swoop
  (use-package helm-swoop
    :defer t
   :bind
   (("C-S-s" . helm-swoop)
    ("M-i" . helm-swoop)
    ("M-s s" . helm-swoop)
    ("M-s M-s" . helm-swoop)
    ("M-I" . helm-swoop-back-to-last-point)
    ("C-c M-i" . helm-multi-swoop)
    ("C-x M-i" . helm-multi-swoop-all)
    )
   :config
   (progn
  ;; When doing isearch, hand the word over to helm-swoop
     (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
  ;; From helm-swoop to helm-multi-swoop-all
     (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
  ;; Move up and down like isearch
  (define-key helm-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-swoop-map (kbd "C-s") 'helm-next-line)
  (define-key helm-multi-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-multi-swoop-map (kbd "C-s") 'helm-next-line)

  )
  )

  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t)

  ;; If this value is t, split window inside the current window
  (setq helm-swoop-split-with-multiple-windows nil)

  ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
  (setq helm-swoop-split-direction 'split-window-vertically)

  ;; If nil, you can slightly boost invoke speed in exchange for text color
  (setq helm-swoop-speed-or-color nil)

  ;; ;; Go to the opposite side of line from the end or beginning of line
  (setq helm-swoop-move-to-line-cycle t)

  ;; Optional face for line numbers
  ;; Face name is `helm-swoop-line-number-face`
  (setq helm-swoop-use-line-number-face t)



#+end_src
