03-For-an-editor/init-daily-using.md

## DONE Snippets<a id="sec-1-16" name="sec-1-16"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:04]</span></span>

Snippets工具可以让我们使用定义好的代码片断，或者文本块，从而可以通过快捷键的方式快速录入。从而提高录入速度。

    (use-package yasnippet
      :defer t
      :diminish yas-minor-mode
      :init (yas-global-mode)
      :config
      (progn
        (yas-global-mode)
        (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
        (setq yas-key-syntaxes '("w_" "w_." "^ "))
        ;;(setq yas-installed-snippets-dir "~/emacs.d-new/yasnippet-snippets")
        (setq yas-installed-snippets-dir (expand-file-name "yasnippet-snippets" user-emacs-directory))
        (setq yas-expand-only-for-last-commands nil)
        (yas-global-mode 1)
        (bind-key "\t" 'hippie-expand yas-minor-mode-map)
        (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)))
    
    
    (defun shk-yas/helm-prompt (prompt choices &optional display-fn)
      "Use helm to select a snippet. Put this into `yas/prompt-functions.'"
      (interactive)
      (setq display-fn (or display-fn 'identity))
      (if (require 'helm-config)
          (let (tmpsource cands result rmap)
            (setq cands (mapcar (lambda (x) (funcall display-fn x)) choices))
            (setq rmap (mapcar (lambda (x) (cons (funcall display-fn x) x)) choices))
            (setq tmpsource
                  (list
                   (cons 'name prompt)
                   (cons 'candidates cands)
                   '(action . (("Expand" . (lambda (selection) selection))))
                   ))
            (setq result (helm-other-buffer '(tmpsource) "*helm-select-yasnippet"))
            (if (null result)
                (signal 'quit "user quit!")
              (cdr (assoc result rmap))))
        nil))
    
    
    (setq default-cursor-color "gray")
    (setq yasnippet-can-fire-cursor-color "purple")
    
    ;; It will test whether it can expand, if yes, cursor color -> green.
    (defun yasnippet-can-fire-p (&optional field)
      (interactive)
      (setq yas--condition-cache-timestamp (current-time))
      (let (templates-and-pos)
        (unless (and yas-expand-only-for-last-commands
                     (not (member last-command yas-expand-only-for-last-commands)))
          (setq templates-and-pos (if field
                                      (save-restriction
                                        (narrow-to-region (yas--field-start field)
                                                          (yas--field-end field))
                                        (yas--templates-for-key-at-point))
                                    (yas--templates-for-key-at-point))))
        (and templates-and-pos (first templates-and-pos))))
    
    (defun my/change-cursor-color-when-can-expand (&optional field)
      (interactive)
      (when (eq last-command 'self-insert-command)
        (set-cursor-color (if (my/can-expand)
                              yasnippet-can-fire-cursor-color
                            default-cursor-color))))
    
    (defun my/can-expand ()
      "Return true if right after an expandable thing."
      (or (abbrev--before-point) (yasnippet-can-fire-p)))
    
                                            ; As pointed out by Dmitri, this will make sure it will update color when needed.
    (remove-hook 'post-command-hook 'my/change-cursor-color-when-can-expand)
    
    (defun my/insert-space-or-expand ()
      "For binding to the SPC SPC keychord."
      (interactive)
      (condition-case nil (or (my/hippie-expand-maybe nil) (insert "  "))))
    
    (defun my/hippie-expand-maybe (arg)
      "Try to expand text before point, using multiple methods.
    The expansion functions in `hippie-expand-try-functions-list' are
    tried in order, until a possible expansion is found.  Repeated
    application of `hippie-expand' inserts successively possible
    expansions.
    With a positive numeric argument, jumps directly to the ARG next
    function in this list.  With a negative argument or just \\[universal-argument],
    undoes the expansion."
      (interactive "P")
      (require 'hippie-exp)
      (if (or (not arg)
              (and (integerp arg) (> arg 0)))
          (let ((first (or (= he-num -1)
                           (not (equal this-command last-command)))))
            (if first
                (progn
                  (setq he-num -1)
                  (setq he-tried-table nil)))
            (if arg
                (if (not first) (he-reset-string))
              (setq arg 0))
            (let ((i (max (+ he-num arg) 0)))
              (while (not (or (>= i (length hippie-expand-try-functions-list))
                              (apply (nth i hippie-expand-try-functions-list)
                                     (list (= he-num i)))))
                (setq i (1+ i)))
              (setq he-num i))
            (if (>= he-num (length hippie-expand-try-functions-list))
                (progn (setq he-num -1) nil)
              (if (and hippie-expand-verbose
                       (not (window-minibuffer-p)))
                  (message "Using %s"
                           (nth he-num hippie-expand-try-functions-list)))))
        (if (and (>= he-num 0)
                 (eq (marker-buffer he-string-beg) (current-buffer)))
            (progn
              (setq he-num -1)
              (he-reset-string)
              (if (and hippie-expand-verbose
                       (not (window-minibuffer-p)))
                  (message "Undoing expansions"))))))

## DONE Edit-list<a id="sec-1-17" name="sec-1-17"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:04]</span></span>

M-x edit-list makes it easier to edit an Emacs Lisp list.
\\#+ombegin\_src emacs-lisp :tangle yes
  (use-package edit-list

:defer t

    :commands edit-list)
\\#+end\_src

## DONE Zap to isearch<a id="sec-1-18" name="sec-1-18"></a>

-   State "DONE"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-05-29 Sun 07:04]</span></span>

From Steve Purcell, who linked to <http://www.emacswiki.org/emacs/ZapToISearch>

    (defun zap-to-isearch (rbeg rend)
      "Kill the region between the mark and the closest portion of
    the isearch match string. The behaviour is meant to be analogous
    to zap-to-char; let's call it zap-to-isearch. The deleted region
    does not include the isearch word. This is meant to be bound only
    in isearch mode.  The point of this function is that oftentimes
    you want to delete some portion of text, one end of which happens
    to be an active isearch word. The observation to make is that if
    you use isearch a lot to move the cursor around (as you should,
    it is much more efficient than using the arrows), it happens a
    lot that you could just delete the active region between the mark
    and the point, not include the isearch word."
      (interactive "r")
      (when (not mark-active)
        (error "Mark is not active"))
      (let* ((isearch-bounds (list isearch-other-end (point)))
             (ismin (apply 'min isearch-bounds))
             (ismax (apply 'max isearch-bounds))
             )
        (if (< (mark) ismin)
            (kill-region (mark) ismin)
          (if (> (mark) ismax)
              (kill-region ismax (mark))
            (error "Internal error in isearch kill function.")))
        (isearch-exit)
        ))
    
    (define-key isearch-mode-map [(meta z)] 'zap-to-isearch)

## Chinese-font-setup<a id="sec-1-19" name="sec-1-19"></a>

在Org-mode中，编辑表格并让表格的分隔线对齐是一件不太容易的事情，主要原因是因为Org-mode中编辑时字母与汉字同时存在时，则字母字体长度与汉字字体宽度不同的原因导致，因此这里的主要解决方案是找到一种通用等宽字体，通过字体的配置来达到最终表格对齐正常。
感谢Chinese-font-setup的包开发者：

### Configuration<a id="sec-1-19-1" name="sec-1-19-1"></a>

    ;; add font-config for chinese double-width fonts issue
    (use-package chinese-fonts-setup
      :config
      (setq cfs-profiles
            '("program" "org-mode" "read-book"))
    )
