03-For-an-editor/init-daily-using.org
*** Shot key binding

#+begin_src emacs-lisp :tangle yes
;; Reset Increase Font size and Descrease Font size short key binding after using chinese-font-setup plugin
;; Reference: https://github.com/tumashu/chinese-fonts-setup
(global-unset-key (kbd "C-x C-=")) ;; remove original font-resize
(global-set-key (kbd "C-x C-=") 'cfs-increase-fontsize)
(global-set-key (kbd "C-x M-=") 'cfs-decrease-fontsize)

#+end_src
** WAITING Smartparens                                              :WAITING:
   - State "WAITING"    from ""           [2016-05-30 Mon 20:36]
*** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package smartparens
    :config
    (require 'smartparens-config)
    (setq sp-autoescape-string-quote nil)
    (--each '(css-mode-hook
              restclient-mode-hook
              js-mode-hook
              java-mode
              ruby-mode
              markdown-mode
              groovy-mode)
      (add-hook it 'turn-on-smartparens-mode))

  )


#+end_src
** Expand-region
*** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :config
    ;; Don't use expand-region fast keys
    (setq expand-region-fast-keys-enabled nil)

    ;; Show expand-region command used
    (setq er--show-expansion-message t)

    )
#+end_src
*** Key bindings for Expand-region
#+begin_src emacs-lisp :tangle yes
;; Expand region (increases selected region by semantic units)
(global-set-key (kbd "C-'") 'er/expand-region)

#+end_src
** Swap-buffer

*** Configuration
#+begin_src emacs-lisp :tangle yes
  ;; add smart swap buffers in multi-windows
  (use-package swap-buffers
    :config
    (global-set-key (kbd "C-x 5") 'swap-buffers)
  )


#+end_src
** Email Reader - Mu4e

Please find [[file:../lisp/init-mu4e.org][Init-Mu4e]].

#+begin_src emacs-lisp :tangle yes
;; load my mu4e configuration from init-mu4e.el
;;(require 'init-mu4e)
  (starter-kit-load "03-For-an-editor/init-mu4e.org")


;;(load-library "init-mu4e")
#+end_src
** Multiple cursors mode
Multiple cursor是一个非常强大的多位置同时编辑的编辑模式，文档可参考：
这里有一个介绍详细的视频：http://emacsrocks.com/e13.html
*** Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors
    :defer t
    :bind
     (("C-c m t" . mc/mark-all-like-this)
      ("C-c m m" . mc/mark-all-like-this-dwim)
      ("C-c m l" . mc/edit-lines)
      ("C-c m e" . mc/edit-ends-of-lines)
      ("C-c m a" . mc/edit-beginnings-of-lines)
      ("C-c m n" . mc/mark-next-like-this)
      ("C-c m p" . mc/mark-previous-like-this)
      ("C-c m s" . mc/mark-sgml-tag-pair)
      ("C-c m d" . mc/mark-all-like-this-in-defun)))
  (use-package phi-search
    :defer t)
  (use-package phi-search-mc
    :defer t
    :config (phi-search-mc/setup-keys))
  (use-package mc-extras
    :defer t
    :config (define-key mc/keymap (kbd "C-. =") 'mc/compare-chars))
#+end_src
*** Short-key binding
#+begin_src emacs-lisp :tangle yes
;; add multi cursors:
;;(require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)

(global-set-key (kbd "C-S-c C-e") 'mc/edit-ends-of-lines)
(global-set-key (kbd "C-S-c C-a") 'mc/edit-beginnings-of-lines)


#+end_src
** Latex mode
#+begin_src emacs-lisp :tangle no
  ;;; latex --- Summary
  ;;; Config for latex
  (use-package auctex
    :defer t)

  (use-package cdlatex
    :defer t
    :config
    (add-hook 'LaTex-mode-hook 'turn-on-org-cdlatex) ;; with AUCTex LaTex mode-line
    (add-hook 'LaTex-mode-hook 'turn-on-org-cdlatex) ;; with Emacs latex mode
  )
  ;; (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)   ; with AUCTeX LaTeX mode
  ;; (add-hook 'latex-mode-hook 'turn-on-cdlatex)   ; with Emacs latex mode

  ;; latex-preview-pane is a minor mode for Emacs that enables you to preview your LaTeX files directly in Emacs.


  (use-package latex-preview-pane
    :defer t
    :config
    (latex-preview-pane-enable))
  ;;(latex-preview-pane-enable)

  ;; magical syntax highlighting for LaTeX-mode buffers
  ;;(require-package 'magic-latex-buffer)
  (use-package magic-latex-buffer
    :defer t
    :config
    (add-hook 'latex-mode-hook 'magic-latex-buffer))
  ;;(add-hook 'latex-mode-hook 'magic-latex-buffer)

  ;;  Adds several useful functionalities to LaTeX-mode. http://github.com/Bruce-Connor/latex-extra

  (use-package latex-extra
    :defer t
    :config
    (add-hook 'latex-mode-hook 'latex-extra-mode))

  ;;(add-hook 'LaTeX-mode-hook #'latex-extra-mode)


#+end_src
** TODO Wgrep
Wgrep是一个可以允许我们在grep模式下进行直接修改的工具，可以允许我们批量添加上Multiple cursors，然后进行批量修改的工具。在快速修改文件时非常方便，类似于sed的批量匹配，批量修改。
#+begin_src emacs-lisp :tangle no
;;; 未配置详细操作，暂时不使用
(use-package wgrep)
#+end_src
** Tabbar
Tabbar，在Emacs中显示一个文件的切换标签，并且标签文件按projectile的进行分组显示，以方便在同一个项目中进行维护和切换文件。
